---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.SpaceConstructions
source: html/48f24c65-a46d-9c62-3b8b-1c5233bd7d65.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.SpaceConstructions Property

Return all the Space constructions of current space.

## Syntax (C#)
```csharp
public MEPBuildingConstructionSet SpaceConstructions { get; }
```

## Remarks
If the name is same with the existing one, an exception will be thrown.